In [9]:
# Import pandas library 
import pandas as pd 
  
# initialize list of lists 
data = [] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Name', 'Age']) 


  
# print dataframe. 
df

Empty DataFrame
Columns: [Name, Age]
Index: []

In [23]:
df.loc[1] = [2, 3]
  
df.loc[4] = [1, 3]

In [24]:
df

   Name Age
1     2   3
10   23   3
2    23   3
4     1   3

In [26]:
df.sort_values(by=['Name'],ascending=False)

   Name Age
10   23   3
2    23   3
1     2   3
4     1   3